{
    "siteInfo": {
        "name": "BraneTrix",
        "tagline": "A Developer's Journal",
        "author": "BraneTrix",
        "baseUrl": "https://triccs.github.io/blog"
    },
    "posts": [
        {
            "id": "aerodrome-tokenomics-excellent-missing",
            "title": "Aerodrome's Tokenomics Are Excellent — That's Why This Is Missing",
            "excerpt": "Aerodrome's incentive program is focused on retaining LPs through cyclical markets where volume will fluctuate. But do traders not deserve to earn DEX ownership as well?",
            "content": "<p>Aerodrome's incentive program is focused on retaining LPs through cyclical markets where volume will fluctuate. But do <em>traders</em> not deserve to earn DEX ownership as well?</p><p>The idea underpinning their current model is that on volume (& therefore fee) downturns, the emissions to LPs will delay their migration to other DEXs or opportunities & may even boost total LPs.</p><p>But what about the volume itself?</p><p>Being able to recruit new traders during market downturns will only aid their flywheel and prime the DEX to skyrocket market share on the reversal.</p><p>Its very unlikely that this was completely missed by Dromos Labs so my guess is that its one of 3 things:</p><ul><li>very hard to qualify meaningful volume</li><li>not as risky</li><li>inefficient use of emissions</li></ul><p>Any trading programs that reward volume attracts wash traders that game the system so that's dead...but if desired there <em>could</em> be a way to reward traders.</p><p>The issue with volumetric rewards is that traders don't actually take any platform OR capital risk. Most platforms choose to provide fee discounts or rebates to traders for holding their token but won't directly pay them.</p><p>While this is an equilibrium I support, aligning the demand side of the market seems powerful. (A more general question for later is if demand side alignment is ever worth it but we'll table that.)</p><p>The core reason I believe they aren't experimenting with trader rewards is simply because its inefficient.</p><p>Traders need LPs to trade.<br>LPs need payment to LP.</p><p>Its economically more efficient to incentivize TVL 100% and let the transitory usage be attracted by the utility enabled by the TVL. Or at least thats the thesis built into the system design of Aerodrome.</p><p>So while I believe that demand side alignment has merit, supply side incentives & alignment seems to kill 2 birds with 1 token.</p>",
            "coverImage": "/images/aero.png",
            "date": "2026-01-03",
            "tags": [
                "defi",
                "tokenomics",
                "aerodrome",
                "dex"
            ],
            "readingTime": 3
        },
        {
            "id": "every-store-does-points-right-except-crypto",
            "title": "every store does points right, except crypto",
            "excerpt": "Here crypto goes again, reinventing things without looking at their history & doing it wrong...again. So how can crypto use points, the right way?",
            "content": "<p>\n    <i>Crypto has a pattern of reinventing the wheel without looking at its history, while running into obvious footguns and sometimes completely missing the point. So how can crypto use points, the right way?</i>\n    <i>\n      <br />\n      <br />\n    </i>\n  </p>\n  <p>My prediction is that the next evolution of points transitions to a non-gameable, directly attributable distribution mechanism used for loyalty and retention programs.\n    <br />\n    <br />\n  </p>\n  <p>\n    <strong>Crypto's Current Approach</strong>\n  </p>\n  <p>Crypto has been using points as a prelaunch token distribution mechanism, an evolution from unsophisticated blind airdrops. But when we look into retail history, calling these points is a misnomer. Dunkin’ points aren’t stock. Crypto points aren’t loyalty programs. And yet both are earned by “users” of the product\n    <i>(pre-TGE points are gamed so heavily that I hesitate to say users)</i>.</p>\n  <br />\n  <br />\n  <p>\n    <strong>Points: Day 0</strong>\n  </p>\n  <p>Loyalty programs date all the way back to Ancient Egypt, though these weren't for customers. Workers were given \"commodity tokens\" as payment for work, wooden talins shaped like beer and bread that were convertible for....beer and bread. The higher ups would then get token multipliers and would use their surplus to buy unrelated items, like how surplus frequent flyer miles can be used to buy iPads.</p>\n  <br />\n  <p>While this doesn’t mesh with our modern idea of a loyalty program as it's closer to an alternative salary, some argue this is exactly what a loyalty program is. A tokenized currency used within a non-fiat closed-loop exchange system. In other words, Dunkin’ points don’t earn you Starbucks frappuccino.</p>\n  <br />\n  <p>\n    <strong>The First Customer-Centric Programs</strong>\n  </p>\n  <p>The first customer-centric points programs started in 1812 Scotland within the Lennoxtown Friendly Victualling Society, a paid membership-based group whose goal was to offer\n    <i>essential goods at the lowest prices</i>. Tracked on a paper ledger, customers would earn a percent share of dividend splits within the co-op, corresponding to the amount they spent over the period. The shops would buy in bulk, sell at a profit and then split profits to the very customers buying. Future shops iterated to incorporate tokenized shares with metal coins which allowed customers to speculate on dividend payouts, more akin to the nature of crypto tokens today.</p>\n  <br />\n  <p>\n    <i>side note:</i>The distributions end up being an average of the net profits of the shop’s sales, so if your purchases have below average profit margins, then you’d “get more back” than if selling the item yourself. But because customers aren’t selling &amp; don’t have the ability to buy an item at cost, this doesn't matter. It's more to illuminate the point that you aren’t going to get outsized returns on your purchases, this isn’t a speculative investment in the business. At most you are speculating that the business will have profits to distribute at all, but you’ll never get more profits than the margins of the items purchased. This is a delayed discount/rebate system, not a new profit stream for the customer.\n    <strong>\n      <br />\n    </strong>\n    <strong>\n      <br />\n    </strong>\n    <br />\n    <strong>But if the goal is to lower prices, why not just sell for less of a profit?</strong>\n  </p>\n  <br />\n  <br />\n  <p>The shops can either sell for $500 upfront and then distribute $50 of profit later equaling $450 net or just sell for $450. Same thing right?</p>\n  <p>\n    <br />\n    <i>Time Value of Money</i>\n  </p>\n  <p>For the shop, upfront capital enables them to order more produce to stock shelves or fix the leaky sink with the extra money they have short term. Then when it comes time to distribute, the shopkeepers can distribute what is actually profit. This is referred to as the “time value of money”, where money upfront is more valuable because you can use it to make more money within the extra time slot. If I gave you $100 million dollars and told you I needed the money back in full for a week, you could make 20k by entering and exiting a 1% yield opportunity. Disregarding any complications, this is the value time with the capital gives you.</p>\n  <br />\n  <p>The co-op shops would order the next round of merchandise and make new sales before having to refund the capital. With the co-op’s 6 month distribution periods, its akin to a free 6 month loan vs. lowering prices. Shops with physical products require stocked shelves making this cyclical influx of capital a lifeline. We want systems that deliver sustainably lower prices, not just lower prices for a month before the shop goes bankrupt.</p>\n  <p>\n    <br />It's simple: would you want $1 million dollars now or $1 million dollars in 10 years?</p>\n  <br />\n  <br />\n  <p>\n    <i>Pro-Social Engineering</i>\n  </p>\n  <p>There are a handful of marketing &amp; behavioral effects that benefit both parties which you’ve experienced yourself with the plethora of points programs used today. The shoppers learn that if they shop more, they earn more back &amp; the shop can’t abuse that by raising prices assuming adequate competition. This is loyalty rewarded and protected by an ineffable law of business: no customers = no business. But to me the more interesting idea is that you can stabilize the costs for a customer within the rebate window, giving loyal customers peace of mind during short term chaos.\n    <br />\n    <br />Using a 3 month period, if each month the shop charges $1 -&gt; $6 -&gt; $3 for an apple, the shop can average out the volatility of the cost to the customer by rebating them $1 to set the 3 month average cost of the apple to $3. It's a 10% discount as the shop figures out a sustainable profit-margin for its product. As a customer, I can then reevaluate after the distribution period to make sure I’m okay with the outcome.</p>\n  <p>\n    <br />\n    <i>The Marketing Budget Revolution</i>\n  </p>\n  <p>The L.H. Parke Company, which started their program in 1895, was quoted referring to their \"premium program\" as \"… part of a plan to give the users of our goods the money we would ordinarily spend on advertising”. Just how far can these programs replace traditional marketing spend?</p>\n  <i>Case Study: Dunkin'</i>\n  <div style=\"text-align: center; margin: 20px 0;\">\n    <img src=\"/images/dunkin-points.png\" alt=\"Image 1\" style=\"max-width: 100%; height: auto;\" />\n  </div>\n  <p>As seen to the, Dunkin’ has added some flavor pumps to their program but at the heart of it it's just a rebate. From the top down, how they are using rebates for marketing, instead of just lowering prices?</p>\n  <br />\n  <p>Everyone loves FREE stuff, it's an age-old high conversion marketing tool. Estee Lauder used it to build a cosmetic powerhouse currently worth 39B, and I mean, I know what the food court samples do to me.\n    <br />\n    <br />Then immediately after, the Dunkin’ gives a clear conversion ratio &amp; a progress bar as humans love growing trackable progress. This adds incalculable behavior changes to rewards users as they get a hit of dopamine seeing progress being made to FREE stuff. This is why companies try so hard to get you to download the app in the first place.</p>\n  <br />\n  <p>A medium hot coffee is $3.40. You can get a free one with 600 points or $60 spent. So every ~18 coffees you get a 19th for free, meaning 19 coffees costs you $3.22, a 5.3% discount for Dunkin’ loyalty.</p>\n  <br />\n  <p>The “Boosted Status” perks are the pinnacle of behavioral hijinks. If you visit 12 times in 1 month you get boosted points for 3 months, where they emphasize in the info icon that it earns you “FREE food and drinks faster”. 12 times is 3 times a week, sounds easy but the behavioral shift that that embeds into your lifestyle is you metaphorically reaching for Dunkin’ more. And then once you earn it, you only get benefits if you buy more Dunkin’ but at that point you’ve earned it, so you’ll think to use it.</p>\n  <br />\n  <p>Finally there is the “4X POINTS” in the Featured section which is direct marketing to existing customers. This is a tool to increase annual customer value, getting your existing customers to spend more with you over the year as opposed to marketing that targets new customers. This enables Dunkin’ to use their points multipliers to slightly lower the profit margins for specific items to get you, the customer, into the store. They also do interesting things like “boosted points if you order ahead on Monday” to improve everyone's Monday experience by reducing lines and getting customers their orders fast before a sluggish workday. It's an incentive that targets repeat customers in a way that benefits both parties. These are business success tools that are unavailable if deciding to simply lower prices instead.</p>\n  <div style=\"text-align: center; margin: 20px 0;\">\n    <img src=\"/images/coupons.png\" alt=\"Image 2\" style=\"max-width: 100%; height: auto;\" />\n  </div>\n  <br />\n  <p>\n    <strong>B.T. Babbitt's Innovation</strong>\n  </p>\n  <p>In the 1850s B.T. Babbitt, Inc. launched an innovative program that is very similar to \"Box Tops\", where customers could cut out stamps from their package and trade them in for items ranging from a harmonica to a 14k gold-filled locket.</p>\n  <br />\n  <p>So instead of a co-op inspired revenue share, these points were directly convertible for trinkets (I wouldn't call anything \"14k gold-filled\" a trinket). But even B.T. Babbitt marketed the convertible program as a profit share, though indirect.</p>\n  <br />\n  <p>One important point is that Babbitt publicly stated the conversion rate was \"half a cent per mark\". There was no speculation around their value &amp; due to their direct conversion to items, there didn't need to be. Crypto: The Land of Speculation, seems to hate predictability to the point that we built markets to speculate on predictions. The conversion rate for token launch points are never public, protocols will change the rules of earning &amp; even cancel the token launch out right, making the points worthless.\n    <br />\n    <br />\n  </p>\n  <p>For Babbitt in particular I do wonder if:\n    <br />a) the profit margins ever affected the conversion rates</p>\n  <p>b) they used the conversion list as an opportunity to create business relationships through collabs or sponsorships.</p>\n  <br />\n  <br />\n  <br />\n  <p>\n    <strong>Stamps as a Service</strong>\n  </p>\n  <p>There was even a \"stamps as a service\" company created in 1896 called The Sperry &amp; Hutchinson Company, facilitating loyalty programs on the behalf of thousands of companies. The immortal itch to create a SaaS business.</p>\n  <br />\n  <p>Eventually the stamp market grew to $754 million by 1963 with over 83% of households saving stamps they earned.</p>\n  <br />\n  <p>In the 1900s there were 2 case studies by the US National Commission on Food Marketing that noted businesses having an increase in revenue over the cost of the stamps regardless of the existence of stamps in the market previously. The key for customer \"loyalty\" programs is that they generate repeat business through the accumulation process, such as rewards for increased spend.</p>\n  <br />\n  <p>\n    <strong>The Common Thread: Profit-Sharing</strong>\n  </p>\n  <p>The main form of loyalty programs have been direct dividends in cash, stamps convertible to items &amp; nowadays, digital points in company specific apps, convertible to free products but what they all have in common is that they are the vehicle for some form of profit-sharing.</p>\n  <br />\n  <p>Using DeFi protocols as an example, which of the 3 forms of profit-sharing to users will work best:</p>\n  <ul>\n    <li>\n      <p>Direct dividends</p>\n    </li>\n    <li>\n      <p>Convertible “stamps”</p>\n    </li>\n    <li>\n      <p>Points -&gt; Product\n        <br />\n        <br />\n      </p>\n    </li>\n  </ul>\n  <p>With the goal of keeping things onchain and cryptographically verifiable, any type of conversion into a physical product won’t work here, hindering conversions of any kind. The app teams themselves can add unlocks to their UI (userface) as a customer progresses through loyalty levels but that is detached from the base layer protocol’s incentives and economics. Its also becomes forced when your UI is gatekeeping basic functions or customizations for a user, when it costs nothing to both parties. That isn’t profit sharing anymore.\n    <br />\n    <br />\n  </p>\n  <p>So the obvious answer is direct dividends as a percent share based on a user’s consumption during some time period. But there are slight problems here, or externalities we have to at least mention even if we may not consider them during this thought experiment. For a grocery store, the user is the consumer. For DeFi’s two-sided marketplace, the users are both the supply AND the demand sides (ex: decentralized exchanges have liquidity providers &amp; traders). So you’d think you’d want a single metric of consumption for both but they represent different entities. The closest side to a shopper is the trader, the demand side, so this solution will assume that the protocol has figured out how to incentivize the suppliers.</p>\n  <br />\n  <p>Something important to reiterate here is that profit distributions are *profit* distributions, not *income* distributions and suppliers will likely be purchased/incentivized as an expense so your shoppers aren’t meant to get 100% of the revenue. Now to confuse you, let's make this hypothetically concrete.</p>\n  <br />\n  <p>\n    <strong>Loyalty Protocol</strong>\n  </p>\n  <p>This hypothetical decentralized exchange will have a token to represent shares of ownership of the protocol’s profits alongside governing rights. To attract liquidity, the protocol pays 80% of its circulating supply to LPs over the first year, meaning by the end of Year 1, the protocol’s LP community will have had control over 80% of the protocol’s profits. The remaining 20% will then be split to traders, where trading more gives you more of the share, up to 20% if you were somehow the only trader.</p>\n  <br />\n  <p>The most important point is that\n    <strong>the percent you give to the shoppers does NOT need to be competitive.</strong>Any money you are distributing to shoppers is a marketing fee. Don’t give them so much so that the product weakens as your supply side shrinks due to a lack of incentives. Capital suppliers work on an “activation energy” model. If they require 81% to supply and you only give them 80% because you want to save 20% for the shoppers, you not only get 0 supply but additionally a weak product, such that there aren’t even profits to distribute TO the shoppers.\n    <br />\n    <br />The method you want to follow will look more like giving 99% to LP suppliers and 1% to shoppers. The large yield percentage you give to suppliers will bootstrap your product base, reducing the cost of the Loyalty Protocol’s trades which will then attract traders who are looking to make efficient trades. The age old vampire. You then make sure to give the traders ownership and in turn, profits-shares for choosing your protocol, giving them a reason to come back &amp; economic stability in the face of potentially volatile product offerings as a the protocol has growing pains.\n    <br />\n    <br />Instead of praying your tokenholders will use your product, just give your product users tokens. Don’t worry about them selling either. If users sell the reward, they are foregoing dividend shares for short term cash, more for the long term aligned traders and LPs.</p>\n  <br />\n  <p>I want to reiterate how this manifests SPECIFICALLY due to the dividend distribution period. If there is 1-day distribution, then the dividend share holders are betting on the revenue of the day. If there is 7-day, it's a bet on weekly revenue. If it's 30-day, it's a bet on monthly revenue. The token itself becomes a more granular signal of the market’s forecasting on the protocol’s success. This period is likely the core aspect that needs to be experimented on.</p>\n  <br />\n  <p>In the research we did, their dividend period was every 6 months but with the risk of crypto and a startup’s lifespan, 6 months is likely way too long. I’d suggest 1 month periods to start.\n    <br />\n    <br />\n  </p>\n  <p>\n    <strong>Is This the Future?</strong>\n  </p>\n  <p>Is this the new realm for competitive edge?</p>\n  <p>Is this a new mechanism for protocols to find a way to overspend?</p>\n  <br />\n  <p>Yes.</p>\n  <br />\n  <p>side note: this will definitely be more chaotic of an equation with the presence of token liquidity</p>\n  <br />\n  <p>side side note: protocols can but probably shouldn't use this as a way to influence market pricing bc if they do, it likely means they are spending too much.</p>\n  <br />\n  <div style=\"text-align: center; margin: 20px 0;\">\n    <img src=\"/images/loyalty-program-history1.png\" alt=\"Image 3\" style=\"max-width: 100%; height: auto;\" />\n  </div>\n  <br />",
            "coverImage": "/images/box-tops.png",
            "date": "2026-01-01",
            "tags": [
                "crypto",
                "points",
                "loyalty",
                "web3"
            ],
            "readingTime": 9
        }
    ]
}