{
    "siteInfo": {
        "name": "BraneTrix",
        "tagline": "A Developer's Journal",
        "author": "BraneTrix",
        "baseUrl": "https://triccs.github.io/blog"
    },
    "posts": [
        {
            "id": "aerodrome-tokenomics-excellent-missing",
            "title": "Aerodrome's Tokenomics Are Excellent — That's Why This Is Missing",
            "excerpt": "Aerodrome's incentive program is focused on retaining LPs through cyclical markets where volume will fluctuate. But do traders not deserve to earn DEX ownership as well?",
            "content": "<p>Aerodrome's incentive program is focused on retaining LPs through cyclical markets where volume will fluctuate. But do <em>traders</em> not deserve to earn DEX ownership as well?</p><p>The idea underpinning their current model is that on volume (& therefore fee) downturns, the emissions to LPs will delay their migration to other DEXs or opportunities & may even boost total LPs.</p><p>But what about the volume itself?</p><p>Being able to recruit new traders during market downturns will only aid their flywheel and prime the DEX to skyrocket market share on the reversal.</p><p>Its very unlikely that this was completely missed by Dromos Labs so my guess is that its one of 3 things:</p><ul><li>very hard to qualify meaningful volume</li><li>not as risky</li><li>inefficient use of emissions</li></ul><p>Any trading programs that reward volume attracts wash traders that game the system so that's dead...but if desired there <em>could</em> be a way to reward traders.</p><p>The issue with volumetric rewards is that traders don't actually take any platform OR capital risk. Most platforms choose to provide fee discounts or rebates to traders for holding their token but won't directly pay them.</p><p>While this is an equilibrium I support, aligning the demand side of the market seems powerful. (A more general question for later is if demand side alignment is ever worth it but we'll table that.)</p><p>The core reason I believe they aren't experimenting with trader rewards is simply because its inefficient.</p><p>Traders need LPs to trade.<br>LPs need payment to LP.</p><p>Its economically more efficient to incentivize TVL 100% and let the transitory usage be attracted by the utility enabled by the TVL. Or at least thats the thesis built into the system design of Aerodrome.</p><p>So while I believe that demand side alignment has merit, supply side incentives & alignment seems to kill 2 birds with 1 token.</p>",
            "coverImage": "/images/aero.png",
            "date": "2026-01-16",
            "tags": ["defi", "tokenomics", "aerodrome", "dex"],
            "readingTime": 3
        },
        {
            "id": "every-store-does-points-right-except-crypto",
            "title": "every store does points right, except crypto",
            "excerpt": "Here crypto goes again, reinventing things without looking at their history & doing it wrong...again. So how can crypto use points, the right way?",
            "content": "<p>Here crypto goes again, reinventing things without looking at their history & doing it wrong...again. So how can crypto use points, the right way?</p><p>Points programs date alllllll the way back to Ancient Egypt, though these weren't for customers. Workers were given \"commodity tokens\", wooden talins shaped like beer and bread, as payment for work, convertible for....beer and bread.</p><p>The higher ups would get token multipliers and would use their surplus to buy other things, similar to how frequent flyer miles can be used to buy iPads if you have enough.</p><p>Can we really consider this a modern points/loyalty program when it seems to be an alternative salary method?</p><p>Some would argue this is a \"a non-fiat exchange system utilising tokenised currencies\".<br>Some would argue thats what a loyalty program is.</p><h2>The First Customer-Centric Programs</h2><p>The first customer-centric points programs started in 1812 in Scotland, using metal tokens & paper to indicate share percentages when splitting dividends to customers within their co-op. Some members would even hoard their \"points\" as a way to speculate on the dividend conversion rate.</p><p>This is akin to a protocol token with revenue share being distributed to its users. The more you spend, the larger your share of the dividends.</p><h2>B.T. Babbitt's Innovation</h2><p>In the 1850s B.T. Babbitt, Inc. launched an innovative program that is very similar to \"Box Tops\", where customers could cut out marks from their package and trade them in for items ranging from a harmonica to a 14k gold-filled locket.</p><p>So instead of a co-op inspired revenue share, these points were directly convertible for trinkets (note: I wouldn't call anything \"14k gold-filled\" a trinket). But even B.T. Babbitt marketed the convertible program as a profit share, tho indirect.</p><p>One important point is that Babbitt publicly stated the conversion rate was \"half a cent per mark\". There was no speculation around their value & due to their direct conversion to items, there didn't need to be.</p><p>This hammers the point the company viewed this as a revenue share in the form of limited choice conversions. I do wonder if a) the profit margins ever affected the conversion rates & b) if they used the conversion list as an opportunity to create business relationships through collabs or sponsorships.</p><h2>The Marketing Budget Revolution</h2><p>The L.H. Parke Company, which started their program in 1895, was quoted referring to their \"premium program\" as \"… part of a plan to give the users of our goods the money we would ordinarily spend on advertising.\"</p><p>This is similar to the benefit of free samples that was pioneered in the makeup industry by Estee Lauder, which would eventually get widely adopted as an alternative use of the marketing budget.</p><p>I mean you've been to a food court, those free samples make the decision easy.</p><h2>Stamps as a Service</h2><p>There was even a \"stamps as a service\" company created in 1896 called The Sperry & Hutchinson Company, facilitating loyalty programs on the behalf of thousands of companies. The SaaS bug is immortal.</p><p>Eventually the stamp market grew to $754 million by 1963 with over 83% of households saving stamps they earned.</p><p>I can't find the year but there were 2 case studies by the US National Commission on Food Marketing that noted businesses having an increase in revenue over the cost of the stamps regardless of the existence of stamps in the market previously.</p><p>The key for customer \"loyalty\" programs is that they generate repeat business through the accumulation process, such as rewards for increased spend. Once again, not really how crypto has been using them currently.</p><h2>Crypto's Current Approach</h2><p>Crypto has been using points mainly as a distribution mechanism pre-TGE as an evolution from unsophisticated airdrops. My prediction is that this transitions to a non-gameable distribution mechanism used for loyalty and retention programs.</p><p>In the world of digital money and decentralized protocols, how can points be used successfully?</p><h2>The Common Thread: Profit-Sharing</h2><p>If you've made it up to this point, you've seen stamps, points & tokens used for loyalty, retention & marketing, but what they all have in common is that they were the vehicle for some form of profit-sharing.</p><p>This actually makes it very easy to convert to protocol usage but it means your token needs to have embedded profit-shares. Then you simply emit tokens to users at some $ value conversion rate to give them access to profits and potentially other protocol related perks.</p><blockquote>\"$5 in fees, earns 10 points @ $0.50 per point\"</blockquote><p>Your token should already have this utility, the key is that your users shouldn't need to buy it separate from use.</p><h2>Is This the Future?</h2><p>Is this the new realm for competitive edge?<br>Is this a new mechanism for protocols to find a way to overspend?</p><p><strong>Yes.</strong></p><p><em>side note:</em> this will definitely be more complicated of an equation with the presence of token liquidity & I'm not sure how effective they will be for finance, but I highly doubt there will be no or negative effects.</p><p><em>side side note:</em> protocols can but probably shouldn't use this as a way to influence market pricing bc if they do, it likely means they are spending too much.</p><h2>Sources</h2><ul><li><a href=\"https://loyaltyrewardco.com/the-true-history-of-loyalty-programs/#:~:text=In%201891%2C%20a%20new%20innovation,stick%20them%20into%20collecting%20books\" target=\"_blank\" rel=\"noopener\">The True History of Loyalty Programs</a> - Loyalty Reward Co</li></ul>",
            "coverImage": "/images/box-tops.png",
            "date": "2026-01-15",
            "tags": ["crypto", "points", "loyalty", "web3"],
            "readingTime": 9
        }
    ]
}

