{
    "siteInfo": {
        "name": "DevLog",
        "tagline": "A Developer's Journal",
        "author": "Your Name",
        "baseUrl": "https://triccs.github.io/blog"
    },
    "posts": [
        {
            "id": "every-store-does-points-right-except-crypto",
            "title": "every store does points right, except crypto",
            "excerpt": "Here crypto goes again, reinventing things without looking at their history & doing it wrong...again. So how can crypto use points, the right way?",
            "content": "<p>Here crypto goes again, reinventing things without looking at their history & doing it wrong...again. So how can crypto use points, the right way?</p><p>Points programs date alllllll the way back to Ancient Egypt, though these weren't for customers. Workers were given \"commodity tokens\", wooden talins shaped like beer and bread, as payment for work, convertible for....beer and bread.</p><p>The higher ups would get token multipliers and would use their surplus to buy other things, similar to how frequent flyer miles can be used to buy iPads if you have enough.</p><p>Can we really consider this a modern points/loyalty program when it seems to be an alternative salary method?</p><p>Some would argue this is a \"a non-fiat exchange system utilising tokenised currencies\".<br>Some would argue thats what a loyalty program is.</p><h2>The First Customer-Centric Programs</h2><p>The first customer-centric points programs started in 1812 in Scotland, using metal tokens & paper to indicate share percentages when splitting dividends to customers within their co-op. Some members would even hoard their \"points\" as a way to speculate on the dividend conversion rate.</p><p>This is akin to a protocol token with revenue share being distributed to its users. The more you spend, the larger your share of the dividends.</p><h2>B.T. Babbitt's Innovation</h2><p>In the 1850s B.T. Babbitt, Inc. launched an innovative program that is very similar to \"Box Tops\", where customers could cut out marks from their package and trade them in for items ranging from a harmonica to a 14k gold-filled locket.</p><p>So instead of a co-op inspired revenue share, these points were directly convertible for trinkets (note: I wouldn't call anything \"14k gold-filled\" a trinket). But even B.T. Babbitt marketed the convertible program as a profit share, tho indirect.</p><p>One important point is that Babbitt publicly stated the conversion rate was \"half a cent per mark\". There was no speculation around their value & due to their direct conversion to items, there didn't need to be.</p><p>This hammers the point the company viewed this as a revenue share in the form of limited choice conversions. I do wonder if a) the profit margins ever affected the conversion rates & b) if they used the conversion list as an opportunity to create business relationships through collabs or sponsorships.</p><h2>The Marketing Budget Revolution</h2><p>The L.H. Parke Company, which started their program in 1895, was quoted referring to their \"premium program\" as \"… part of a plan to give the users of our goods the money we would ordinarily spend on advertising.\"</p><p>This is similar to the benefit of free samples that was pioneered in the makeup industry by Estee Lauder, which would eventually get widely adopted as an alternative use of the marketing budget.</p><p>I mean you've been to a food court, those free samples make the decision easy.</p><h2>Stamps as a Service</h2><p>There was even a \"stamps as a service\" company created in 1896 called The Sperry & Hutchinson Company, facilitating loyalty programs on the behalf of thousands of companies. The SaaS bug is immortal.</p><p>Eventually the stamp market grew to $754 million by 1963 with over 83% of households saving stamps they earned.</p><p>I can't find the year but there were 2 case studies by the US National Commission on Food Marketing that noted businesses having an increase in revenue over the cost of the stamps regardless of the existence of stamps in the market previously.</p><p>The key for customer \"loyalty\" programs is that they generate repeat business through the accumulation process, such as rewards for increased spend. Once again, not really how crypto has been using them currently.</p><h2>Crypto's Current Approach</h2><p>Crypto has been using points mainly as a distribution mechanism pre-TGE as an evolution from unsophisticated airdrops. My prediction is that this transitions to a non-gameable distribution mechanism used for loyalty and retention programs.</p><p>In the world of digital money and decentralized protocols, how can points be used successfully?</p><h2>The Common Thread: Profit-Sharing</h2><p>If you've made it up to this point, you've seen stamps, points & tokens used for loyalty, retention & marketing, but what they all have in common is that they were the vehicle for some form of profit-sharing.</p><p>This actually makes it very easy to convert to protocol usage but it means your token needs to have embedded profit-shares. Then you simply emit tokens to users at some $ value conversion rate to give them access to profits and potentially other protocol related perks.</p><blockquote>\"$5 in fees, earns 10 points @ $0.50 per point\"</blockquote><p>Your token should already have this utility, the key is that your users shouldn't need to buy it separate from use.</p><h2>Is This the Future?</h2><p>Is this the new realm for competitive edge?<br>Is this a new mechanism for protocols to find a way to overspend?</p><p><strong>Yes.</strong></p><p><em>side note:</em> this will definitely be more complicated of an equation with the presence of token liquidity & I'm not sure how effective they will be for finance, but I highly doubt there will be no or negative effects.</p><p><em>side side note:</em> protocols can but probably shouldn't use this as a way to influence market pricing bc if they do, it likely means they are spending too much.</p><h2>Sources</h2><ul><li><a href=\"https://loyaltyrewardco.com/the-true-history-of-loyalty-programs/#:~:text=In%201891%2C%20a%20new%20innovation,stick%20them%20into%20collecting%20books\" target=\"_blank\" rel=\"noopener\">The True History of Loyalty Programs</a> - Loyalty Reward Co</li></ul>",
            "coverImage": "/images/box-tops.png",
            "date": "2026-01-15",
            "tags": ["crypto", "points", "loyalty", "web3"],
            "readingTime": 9
        },
        {
            "id": "building-a-fast-blog",
            "title": "Building a Lightning-Fast Blog with Vanilla HTML",
            "excerpt": "Why I ditched frameworks and built this blog with just HTML, CSS, and JavaScript. Spoiler: it loads in under 50KB.",
            "content": "<p>When I set out to build this blog, I had one goal in mind: <strong>speed</strong>. I wanted pages that load instantly, no matter the connection. And I wanted to prove that you don't need React, Vue, or any framework to build something beautiful.</p><h2>The Problem with Modern Web Development</h2><p>We've somehow convinced ourselves that every website needs 500KB of JavaScript just to display text. Blog posts that could be simple HTML documents now require entire component libraries, build tools, and runtime hydration.</p><p>Don't get me wrong — frameworks are incredible for complex applications. But for a blog? It's overkill.</p><h2>The Solution: Back to Basics</h2><p>This blog is built with:</p><ul><li><strong>Vanilla HTML</strong> — semantic, accessible, SEO-friendly</li><li><strong>CSS</strong> — no Tailwind, no CSS-in-JS, just good old stylesheets</li><li><strong>Minimal JavaScript</strong> — only for loading posts from JSON</li></ul><p>The result? The entire homepage loads in <code>under 50KB</code>. That's smaller than most hero images.</p><h2>The Architecture</h2><p>Posts are stored as JSON data and rendered client-side. This gives me the flexibility of a CMS without the overhead. Adding a new post is as simple as editing a JSON file.</p><pre><code>{\n  \"id\": \"my-post\",\n  \"title\": \"My New Post\",\n  \"content\": \"...\"\n}</code></pre><p>Is it as powerful as a full static site generator? No. Is it fast, simple, and exactly what I need? Absolutely.</p><blockquote>Sometimes the best tool is the one you already know.</blockquote><p>If you're building a simple blog or portfolio, consider going framework-free. Your users (and their data plans) will thank you.</p>",
            "coverImage": "https://images.unsplash.com/photo-1461749280684-dccba630e2f6?w=800&q=80",
            "date": "2026-01-01",
            "tags": ["webdev", "performance", "html"],
            "readingTime": 4
        },
        {
            "id": "dark-mode-done-right",
            "title": "Dark Mode Done Right: A CSS Deep Dive",
            "excerpt": "CSS custom properties make theming easier than ever. Here's how I built a dark theme that doesn't feel like an afterthought.",
            "content": "<p>Dark mode isn't just about flipping colors from white to black. A well-designed dark theme requires careful consideration of contrast, hierarchy, and visual comfort.</p><h2>Why Dark Mode Matters</h2><p>Beyond aesthetics, dark themes offer real benefits:</p><ul><li><strong>Reduced eye strain</strong> in low-light environments</li><li><strong>Better battery life</strong> on OLED screens</li><li><strong>Improved focus</strong> — less visual noise means more attention on content</li></ul><h2>The Foundation: CSS Custom Properties</h2><p>The key to maintainable theming is CSS variables. Define your colors once, use them everywhere:</p><pre><code>:root {\n  --bg-primary: #0d1117;\n  --text-primary: #e6edf3;\n  --accent: #00d9ff;\n}</code></pre><p>Now every component references these variables instead of hardcoded colors. Switching themes becomes trivial.</p><h2>The Secret Sauce: Subtle Gradients</h2><p>Pure black backgrounds feel flat and lifeless. The trick is adding subtle gradients that create depth without being distracting:</p><pre><code>.gradient-bg {\n  background: \n    radial-gradient(\n      ellipse at 20% 0%, \n      rgba(0, 217, 255, 0.08) 0%, \n      transparent 50%\n    );\n}</code></pre><p>This creates a gentle glow effect that makes the page feel more dynamic and alive.</p><h2>Glow Effects: Use Sparingly</h2><p>Accent colors should pop, but too much glow turns your site into a rave. Use <code>box-shadow</code> and <code>text-shadow</code> only for interactive elements and key highlights.</p><blockquote>Dark mode is about subtraction, not just inversion.</blockquote><p>The goal is to remove distractions, not add new ones. Let the content breathe.</p>",
            "coverImage": "https://images.unsplash.com/photo-1555066931-4365d14bab8c?w=800&q=80",
            "date": "2025-12-28",
            "tags": ["css", "design", "darkmode"],
            "readingTime": 5
        },
        {
            "id": "seo-for-developers",
            "title": "SEO for Developers: Beyond the Basics",
            "excerpt": "Meta tags are just the beginning. Learn how structured data, semantic HTML, and performance impact your search rankings.",
            "content": "<p>SEO often gets dismissed as marketing fluff, but as developers, we have more control over search rankings than we realize. The code we write directly impacts discoverability.</p><h2>The Technical Foundation</h2><p>Before thinking about keywords, get the fundamentals right:</p><ul><li><strong>Semantic HTML</strong> — Use <code>&lt;article&gt;</code>, <code>&lt;nav&gt;</code>, <code>&lt;main&gt;</code>, not just divs</li><li><strong>Proper heading hierarchy</strong> — One <code>&lt;h1&gt;</code>, sequential <code>&lt;h2&gt;</code>s and <code>&lt;h3&gt;</code>s</li><li><strong>Accessible images</strong> — Always include descriptive <code>alt</code> text</li></ul><h2>Open Graph & Twitter Cards</h2><p>When someone shares your link on social media, you control what they see:</p><pre><code>&lt;meta property=\"og:title\" content=\"Your Title\"&gt;\n&lt;meta property=\"og:image\" content=\"/preview.jpg\"&gt;\n&lt;meta property=\"og:description\" content=\"...\"&gt;</code></pre><p>Without these, platforms pull whatever text they find — usually something awkward like your copyright notice.</p><h2>Structured Data (JSON-LD)</h2><p>This is where it gets powerful. JSON-LD tells search engines exactly what your content is:</p><pre><code>{\n  \"@type\": \"Article\",\n  \"headline\": \"Your Title\",\n  \"author\": { \"@type\": \"Person\", \"name\": \"...\" },\n  \"datePublished\": \"2026-01-01\"\n}</code></pre><p>This can unlock rich snippets, knowledge panels, and better placement in search results.</p><h2>Performance is SEO</h2><p>Google uses Core Web Vitals as ranking factors. A slow site will rank lower, no matter how good your content is.</p><blockquote>The fastest page is the one that doesn't need to load unnecessary resources.</blockquote><p>Optimize images, minimize JavaScript, and watch your rankings climb.</p>",
            "coverImage": "https://images.unsplash.com/photo-1432888498266-38ffec3eaf0a?w=800&q=80",
            "date": "2025-12-20",
            "tags": ["seo", "webdev", "performance"],
            "readingTime": 6
        }
    ]
}

